[
  {
    "phase": "Phase 1: Awakening",
    "subtitle": "The Signal Has Been Received",
    "timeline": "",
    "status": "in-progress",
    "icon": "fas fa-satellite-dish",
    "description": "The genesis of Serpo Coin begins with the first transmission.",
    "milestones": [
      "Launch Serpo Coin on TON blockchain",
      "Airdrops & NFT rewards for early buyers and supporters",
      "Bonding Curve model introduced for gradual token price growth",
      "DEX Listings to enable decentralized trading",
      "Web3 Wallet Listings (Binance Web3, OKX Web3, and other exchanges)",
      "Buy directly from STON.fi pool"
    ]
  },
  {
    "phase": "Phase 2: Interstellar Economy",
    "subtitle": "Building the Serpo Gateway",
    "timeline": "",
    "status": "upcoming",
    "icon": "fas fa-robot",
    "description": "Creating the infrastructure for the cosmic economy with AI assistance and storytelling.",
    "milestones": [
      "Development of Serpo AI - Smart assistant helping traders analyze markets",
      "AI offers technical analysis, sentiment tracking, and crypto research tools",
      "Serpo Animation Storyline launched for community engagement and brand lore",
      "Infrastructure setup for DAO, metaverse, and marketplace systems"
    ]
  },
  {
    "phase": "Phase 3: The Portal Network",
    "subtitle": "Earth and Serpo Now Linked",
    "timeline": "",
    "status": "upcoming",
    "icon": "fas fa-shopping-bag",
    "description": "Bridging worlds through cross-chain technology and real-world commerce.",
    "milestones": [
      "Bridge Serpo Coin with other blockchains (cross-chain interoperability)",
      "Global & Local Business Partnerships for advertising and crypto payments",
      "Serpo Marketplace — 'The AstroBazaar' - Multi-item market (phones, clothes, shoes, NFTs, food)",
      "Partnerships with Small Games & 3D Web Apps - Integrate Serpo Coin as utility token",
      "Serpo Academy - Educational platform for all service providers through classes and courses, with Serpo Coin as payment method"
    ]
  },
  {
    "phase": "Phase 4: The Serpo Civilization",
    "subtitle": "The Council Has Formed",
    "timeline": "",
    "status": "upcoming",
    "icon": "fas fa-users",
    "description": "Community governance and immersive digital experiences take center stage.",
    "milestones": [
      "SerpoVerse Launch - A 3D virtual colony for users, creators, and DAO members",
      "Serpo Wallet + P2P Trading - Integrated wallet system for swaps, staking, and transfers",
      "DAO Governance (Serpo Council) - Three ranks: Observers, Envoys, and Elders",
      "Members vote on proposals and ecosystem upgrades",
      "Community & NFT Hubs inside the SerpoVerse"
    ]
  },
  {
    "phase": "Phase 5: Beyond The Stars",
    "subtitle": "The Journey Continues Beyond Space",
    "timeline": "",
    "status": "upcoming",
    "icon": "fas fa-rocket",
    "description": "Expanding into new frontiers with major listings and continuous evolution.",
    "milestones": [
      "Major Exchange Listings (CEX)",
      "DAO-Driven Upgrades - Council votes shape future policies",
      "Ecosystem Evolution - Scaling AI tools, marketplaces, and metaverse expansion"
    ]
  }
]
